**Dataframes** - a 2-dimensional labeled data structure with columns of potentially different data types.

In [2]:
import pandas as pd
import numpy as np

In [3]:
# creating a dataframe using pd.DataFrame function

from numpy.random import randint
np.random.seed(100)

df = pd.DataFrame(randint(0,100,(4,4)))
df

    0   1   2   3
0   8  24  67  87
1  79  48  10  94
2  52  98  53  66
3  98  14  34  24

In [8]:
np.random.seed(100)
df = pd.DataFrame(randint(0,100,(4,4)), index = ['Deng', 'Brian', 'George', 'Lynne'],\
                 columns = ['MD1', 'MD2', 'MD3', 'MD4'])  # MD = Match Day

df

        MD1  MD2  MD3  MD4
Deng      8   24   67   87
Brian    79   48   10   94
George   52   98   53   66
Lynne    98   14   34   24

Atrributes of a dataframe

In [9]:
print("Type of df :", type(df))

print("Shape of df :", df.shape)

print("Index of df :", df.index)

print("Columns of the df :", df.columns)

Type of df : <class 'pandas.core.frame.DataFrame'>
Shape of df : (4, 4)
Index of df : Index(['Deng', 'Brian', 'George', 'Lynne'], dtype='object')
Columns of the df : Index(['MD1', 'MD2', 'MD3', 'MD4'], dtype='object')

Selecting columns from a DataFrame

In [10]:
df

        MD1  MD2  MD3  MD4
Deng      8   24   67   87
Brian    79   48   10   94
George   52   98   53   66
Lynne    98   14   34   24

In [16]:
print(df['MD1']) # selecting columns from a dataframe

print('\nAnother way to select a column is:')

df.MD1

Deng       8
Brian     79
George    52
Lynne     98
Name: MD1, dtype: int32

Another way to select a column is:

Deng       8
Brian     79
George    52
Lynne     98
Name: MD1, dtype: int32

In [17]:
type(df['MD2']) # datatype of columns in a dataframe

pandas.core.series.Series

In [18]:
# selecting multiple columns from a DataFrame

df[['MD2', 'MD3']]

        MD2  MD3
Deng     24   67
Brian    48   10
George   98   53
Lynne    14   34

Creating a new column in a DataFrame

In [19]:
df['Total_score'] = df['MD1'] + df['MD2'] + df['MD3'] + df['MD4']

df

        MD1  MD2  MD3  MD4  Total_score
Deng      8   24   67   87          186
Brian    79   48   10   94          231
George   52   98   53   66          269
Lynne    98   14   34   24          170

Dropping columns and rows of a DataFrame

In [23]:
# dropping columns

# df.drop('Total_score', axis = 1) # dropping total_score column from the dataframe
# df.drop('MD4', axis = 1)
df.drop(['MD1', 'MD2'], axis = 1) # dropping multiple columns

        MD3  MD4  Total_score
Deng     67   87          186
Brian    10   94          231
George   53   66          269
Lynne    34   24          170

In [25]:
df

        MD1  MD2  MD3  MD4  Total_score
Deng      8   24   67   87          186
Brian    79   48   10   94          231
George   52   98   53   66          269
Lynne    98   14   34   24          170

In [26]:
# inplace = truenis used to permanently drop a column

df.drop('Total_score', axis = 1, inplace = True)

In [27]:
df

        MD1  MD2  MD3  MD4
Deng      8   24   67   87
Brian    79   48   10   94
George   52   98   53   66
Lynne    98   14   34   24

In [28]:
# dropping rows

df.drop('Deng', axis = 0)

        MD1  MD2  MD3  MD4
Brian    79   48   10   94
George   52   98   53   66
Lynne    98   14   34   24

Inspecting data withhin a DataFrame using pd.loc and pd.iloc function

In [29]:
# selecting row by index name

df

        MD1  MD2  MD3  MD4
Deng      8   24   67   87
Brian    79   48   10   94
George   52   98   53   66
Lynne    98   14   34   24

In [32]:
df.loc['Deng'] # selecting a row using a row index name

MD1     8
MD2    24
MD3    67
MD4    87
Name: Deng, dtype: int32

In [34]:
# selecting a value using row index and column name

print(df.loc['Deng', 'MD4'])

87

In [35]:
# selecting a subset of rows and columns using their names

df.loc[['Deng', 'Brian'], ['MD2', 'MD3']]

       MD2  MD3
Deng    24   67
Brian   48   10

In [41]:
# selecting a range of rows and columns using their names

df.loc['Deng': 'George','MD1':'MD3']

        MD1  MD2  MD3
Deng      8   24   67
Brian    79   48   10
George   52   98   53

In [42]:
df

        MD1  MD2  MD3  MD4
Deng      8   24   67   87
Brian    79   48   10   94
George   52   98   53   66
Lynne    98   14   34   24

In [46]:
# integer location - iloc
# selecting a row using an index number

df.iloc[2]

MD1    52
MD2    98
MD3    53
MD4    66
Name: George, dtype: int32

In [47]:
# selecting a value using row and column index

df.iloc[0,2]

np.int32(67)

In [48]:
# selecting a subset of rows using their indices

df.iloc[[0,2], [1,3]]

        MD2  MD4
Deng     24   87
George   98   66

In [49]:
# selecting a range of rows and columns using their indices

df.iloc[0:2, 1:3]

       MD2  MD3
Deng    24   67
Brian   48   10